import { Swiper, SwiperSlide } from "swiper/react";
import { Pagination, Autoplay } from "swiper/modules";

export default function LeftBox() {
  return (
    <div className="gradient h-full rounded-4xl flex flex-col items-center justify-around gap-4 py-7 lg:py-0!">
      <div className="text-white text-center">
        <h3 className="text-lg xs:text-xl! sm:text-2xl! md:text-lg! lg:text-2xl! mb-3 sm:mb-8!">ورود به دیجی پلاس و خرید، سریع و مطمئن</h3>
        <h1 className="font-bold text-xl xs:text-2xl! sm:text-4xl! md:text-2xl! lg:text-3xl! xl:text-4xl!">همه چیز به خوبی پیش میره!</h1>
      </div>
      <div className="w-full px-5 ">
        <Swiper
          className="max-w-full rounded-3xl pt-8!"
          slidesPerView={1}
          modules={[Pagination, Autoplay]}
          pagination={{
            el: ".auth-slider-pagination",
            clickable: true,
          }}
          autoplay={{
            delay: 4000,
            disableOnInteraction: false,
          }}
          spaceBetween={15}
          grabCursor
        >
          <SwiperSlide className=" bg-white py-5 px-3 rounded-3xl">
            <div className="flex flex-col gap-5 relative">
              <div className="flex items-center gap-1">
                <img className="size-10 rounded-full" src="https://digiplus.aet-web.ir/wp-content/uploads/2025/02/Ellipse-71.png" alt="" />
                <b className="text-dark">پژمان رسولی</b>
              </div>
              <p className="leading-6">روند خرید از سایت شما خیلی راحت و سریع بود. از لحظه ورود تا پرداخت نهایی، همه چیز خیلی روان پیش رفت و هیچ مشکلی نداشتم. حتی اطلاع‌رسانی‌های مربوط به سفارش هم به‌موقع بود. تجربه خرید واقعاً لذت‌بخش و بدون دردسری داشتم! </p>
              <div className="flex items-center justify-between ">
                <div className="flex items-center gap-1 text-xs">
                  <span className="fill-gray">
                    <svg xmlns="http://www.w3.org/2000/svg" width="20" height="20" viewBox="0 0 20 20" class="ms-2">
                      <path d="M10.0004 11.8084C8.22539 11.8084 6.77539 10.3667 6.77539 8.58337C6.77539 6.80003 8.22539 5.3667 10.0004 5.3667C11.7754 5.3667 13.2254 6.80837 13.2254 8.5917C13.2254 10.375 11.7754 11.8084 10.0004 11.8084ZM10.0004 6.6167C8.91706 6.6167 8.02539 7.50003 8.02539 8.5917C8.02539 9.68337 8.90872 10.5667 10.0004 10.5667C11.0921 10.5667 11.9754 9.68337 11.9754 8.5917C11.9754 7.50003 11.0837 6.6167 10.0004 6.6167Z"></path>
                      <path d="M10.0014 18.9665C8.76803 18.9665 7.52637 18.4998 6.5597 17.5748C4.10137 15.2082 1.3847 11.4332 2.4097 6.9415C3.3347 2.8665 6.89303 1.0415 10.0014 1.0415C10.0014 1.0415 10.0014 1.0415 10.0097 1.0415C13.118 1.0415 16.6764 2.8665 17.6014 6.94984C18.618 11.4415 15.9014 15.2082 13.443 17.5748C12.4764 18.4998 11.2347 18.9665 10.0014 18.9665ZM10.0014 2.2915C7.57637 2.2915 4.4597 3.58317 3.6347 7.2165C2.7347 11.1415 5.20137 14.5248 7.4347 16.6665C8.87637 18.0582 11.1347 18.0582 12.5764 16.6665C14.8014 14.5248 17.268 11.1415 16.3847 7.2165C15.5514 3.58317 12.4264 2.2915 10.0014 2.2915Z"></path>
                    </svg>
                  </span>
                  <span>البرز,کرج</span>
                </div>
                <div className="flex items-center gap-1 text-xs">
                  <b className="text-star text-2xl">4</b>
                  <span>
                    <svg className="fill-star" xmlns="http://www.w3.org/2000/svg" width="24" height="22" viewBox="0 0 24 22">
                      <path d="M11.9958 0C12.3792 0 12.7292 0.225586 12.8958 0.580938L15.7542 6.65156L22.1417 7.62695C22.5167 7.68281 22.825 7.95352 22.9458 8.32305C23.0625 8.69688 22.9667 9.10508 22.7 9.37578L18.0667 14.1109L19.1625 20.7926C19.225 21.1793 19.0709 21.5746 18.7584 21.8023C18.45 22.0301 18.0042 22.0602 17.7042 21.8754L11.9958 18.7301L6.25418 21.8754C5.95418 22.0602 5.54585 22.0301 5.23335 21.8023C4.92502 21.5746 4.77085 21.1793 4.79585 20.7926L5.92502 14.1109L1.29627 9.37578C1.0271 9.10508 0.931682 8.69688 1.05002 8.32305C1.16793 7.95352 1.47918 7.68281 1.85377 7.62695L8.23752 6.65156L11.0958 0.580938C11.2667 0.225543 11.6125 0 11.9958 0ZM11.9958 3.39238L9.80835 8.04375C9.66252 8.34883 9.37918 8.56367 9.05418 8.61524L4.12418 9.36289L7.70418 13.0195C7.93335 13.2559 8.03752 13.5953 7.98335 13.9262L7.14168 19.0652L11.525 16.6504C11.8208 16.4871 12.175 16.4871 12.4667 16.6504L16.85 19.0652L16.0083 13.9262C15.9542 13.5953 16.0625 13.2559 16.2917 13.0195L19.8708 9.36289L14.9417 8.61524C14.6125 8.56367 14.3292 8.34883 14.1875 8.04375L11.9958 3.39238Z"></path>
                      <path d="M7.70418 13.0195C7.93335 13.2559 8.03752 13.5953 7.98335 13.9262L7.14168 19.0652L11.525 16.6504C11.8208 16.4871 12.175 16.4871 12.4667 16.6504L16.85 19.0652L16.0083 13.9262C15.9542 13.5953 16.0625 13.2559 16.2917 13.0195L19.8708 9.36289L14.9417 8.61524C14.6125 8.56367 14.3292 8.34883 14.1875 8.04375L11.9958 3.39238V11L7.70418 13.0195Z"></path>
                      <path d="M11.9958 3.39238L9.80835 8.04375C9.66252 8.34883 9.37918 8.56367 9.05418 8.61524L4.12418 9.36289L7.70418 13.0195L11.9958 11V3.39238Z"></path>
                    </svg>
                  </span>
                </div>
              </div>
              <div className="absolute left-3 -top-12">
                <svg xmlns="http://www.w3.org/2000/svg" width="56" height="56" viewBox="0 0 56 56" fill="none">
                  <g filter="url(#filter0_d_2103_5130)">
                    <path d="M18.1993 50.0968H10.6861C6.41606 50.0968 2.91602 46.6202 2.91602 42.3269V28.7936C2.91602 27.8369 3.70935 27.0436 4.66602 27.0436H18.1993C22.6327 27.0436 25.9694 30.3801 25.9694 34.8135V42.3269C25.946 46.7602 22.6093 50.0968 18.1993 50.0968ZM6.41602 30.5668V42.3502C6.41602 44.7069 8.32939 46.6201 10.6861 46.6201H18.1993C20.6727 46.6201 22.4694 44.8236 22.4694 42.3502V34.8368C22.4694 32.3635 20.6727 30.5668 18.1993 30.5668H6.41602Z" fill="#DC2F02"></path>
                    <path d="M4.66602 30.5668C3.70935 30.5668 2.91602 29.7734 2.91602 28.8168C2.91602 14.2334 5.87941 11.1769 14.3494 6.16019C15.1894 5.67019 16.2627 5.95021 16.7527 6.76688C17.2427 7.60688 16.9626 8.68014 16.146 9.17014C8.58598 13.6501 6.41602 15.5168 6.41602 28.8168C6.41602 29.7734 5.62268 30.5668 4.66602 30.5668Z" fill="#DC2F02"></path>
                    <path d="M45.3146 50.0968H37.8013C33.5313 50.0968 30.0312 46.6202 30.0312 42.3269V28.7936C30.0312 27.8369 30.8246 27.0436 31.7812 27.0436H45.3146C49.7479 27.0436 53.0846 30.3801 53.0846 34.8135V42.3269C53.0846 46.7602 49.7479 50.0968 45.3146 50.0968ZM33.5546 30.5668V42.3502C33.5546 44.7069 35.468 46.6201 37.8246 46.6201H45.3379C47.8112 46.6201 49.608 44.8236 49.608 42.3502V34.8368C49.608 32.3635 47.8112 30.5668 45.3379 30.5668H33.5546Z" fill="#DC2F02"></path>
                    <path d="M31.8027 30.5668C30.8461 30.5668 30.0527 29.7734 30.0527 28.8168C30.0527 14.2334 33.0161 11.1769 41.4861 6.16019C42.3261 5.67019 43.3994 5.95021 43.8894 6.76688C44.3794 7.60688 44.0994 8.68014 43.2827 9.17014C35.7227 13.6501 33.5527 15.5168 33.5527 28.8168C33.5527 29.7734 32.7594 30.5668 31.8027 30.5668Z" fill="#DC2F02"></path>
                  </g>
                  <defs>
                    <filter id="filter0_d_2103_5130" x="2.91602" y="5.91821" width="52.168" height="44.1786" filterUnits="userSpaceOnUse" color-interpolation-filters="sRGB">
                      <feFlood flood-opacity="0" result="BackgroundImageFix"></feFlood>
                      <feColorMatrix in="SourceAlpha" type="matrix" values="0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 127 0" result="hardAlpha"></feColorMatrix>
                      <feOffset dx="2"></feOffset>
                      <feComposite in2="hardAlpha" operator="out"></feComposite>
                      <feColorMatrix type="matrix" values="0 0 0 0 0.53 0 0 0 0 0.113227 0 0 0 0 0.00481818 0 0 0 1 0"></feColorMatrix>
                      <feBlend mode="normal" in2="BackgroundImageFix" result="effect1_dropShadow_2103_5130"></feBlend>
                      <feBlend mode="normal" in="SourceGraphic" in2="effect1_dropShadow_2103_5130" result="shape"></feBlend>
                    </filter>
                  </defs>
                </svg>
              </div>
            </div>
          </SwiperSlide>
          <SwiperSlide className=" bg-white py-5 px-3 rounded-3xl">
            <div className="flex flex-col gap-5 relative">
              <div className="flex items-center gap-1">
                <img className="size-10 rounded-full" src="https://digiplus.aet-web.ir/wp-content/uploads/2025/02/Ellipse-71.png" alt="" />
                <b className="text-dark">پژمان رسولی</b>
              </div>
              <p className="leading-6">روند خرید از سایت شما خیلی راحت و سریع بود. از لحظه ورود تا پرداخت نهایی، همه چیز خیلی روان پیش رفت و هیچ مشکلی نداشتم. حتی اطلاع‌رسانی‌های مربوط به سفارش هم به‌موقع بود. تجربه خرید واقعاً لذت‌بخش و بدون دردسری داشتم! </p>
              <div className="flex items-center justify-between ">
                <div className="flex items-center gap-1 text-xs">
                  <span className="fill-gray">
                    <svg xmlns="http://www.w3.org/2000/svg" width="20" height="20" viewBox="0 0 20 20" class="ms-2">
                      <path d="M10.0004 11.8084C8.22539 11.8084 6.77539 10.3667 6.77539 8.58337C6.77539 6.80003 8.22539 5.3667 10.0004 5.3667C11.7754 5.3667 13.2254 6.80837 13.2254 8.5917C13.2254 10.375 11.7754 11.8084 10.0004 11.8084ZM10.0004 6.6167C8.91706 6.6167 8.02539 7.50003 8.02539 8.5917C8.02539 9.68337 8.90872 10.5667 10.0004 10.5667C11.0921 10.5667 11.9754 9.68337 11.9754 8.5917C11.9754 7.50003 11.0837 6.6167 10.0004 6.6167Z"></path>
                      <path d="M10.0014 18.9665C8.76803 18.9665 7.52637 18.4998 6.5597 17.5748C4.10137 15.2082 1.3847 11.4332 2.4097 6.9415C3.3347 2.8665 6.89303 1.0415 10.0014 1.0415C10.0014 1.0415 10.0014 1.0415 10.0097 1.0415C13.118 1.0415 16.6764 2.8665 17.6014 6.94984C18.618 11.4415 15.9014 15.2082 13.443 17.5748C12.4764 18.4998 11.2347 18.9665 10.0014 18.9665ZM10.0014 2.2915C7.57637 2.2915 4.4597 3.58317 3.6347 7.2165C2.7347 11.1415 5.20137 14.5248 7.4347 16.6665C8.87637 18.0582 11.1347 18.0582 12.5764 16.6665C14.8014 14.5248 17.268 11.1415 16.3847 7.2165C15.5514 3.58317 12.4264 2.2915 10.0014 2.2915Z"></path>
                    </svg>
                  </span>
                  <span>البرز,کرج</span>
                </div>
                <div className="flex items-center gap-1 text-xs">
                  <b className="text-star text-2xl">4</b>
                  <span>
                    <svg className="fill-star" xmlns="http://www.w3.org/2000/svg" width="24" height="22" viewBox="0 0 24 22">
                      <path d="M11.9958 0C12.3792 0 12.7292 0.225586 12.8958 0.580938L15.7542 6.65156L22.1417 7.62695C22.5167 7.68281 22.825 7.95352 22.9458 8.32305C23.0625 8.69688 22.9667 9.10508 22.7 9.37578L18.0667 14.1109L19.1625 20.7926C19.225 21.1793 19.0709 21.5746 18.7584 21.8023C18.45 22.0301 18.0042 22.0602 17.7042 21.8754L11.9958 18.7301L6.25418 21.8754C5.95418 22.0602 5.54585 22.0301 5.23335 21.8023C4.92502 21.5746 4.77085 21.1793 4.79585 20.7926L5.92502 14.1109L1.29627 9.37578C1.0271 9.10508 0.931682 8.69688 1.05002 8.32305C1.16793 7.95352 1.47918 7.68281 1.85377 7.62695L8.23752 6.65156L11.0958 0.580938C11.2667 0.225543 11.6125 0 11.9958 0ZM11.9958 3.39238L9.80835 8.04375C9.66252 8.34883 9.37918 8.56367 9.05418 8.61524L4.12418 9.36289L7.70418 13.0195C7.93335 13.2559 8.03752 13.5953 7.98335 13.9262L7.14168 19.0652L11.525 16.6504C11.8208 16.4871 12.175 16.4871 12.4667 16.6504L16.85 19.0652L16.0083 13.9262C15.9542 13.5953 16.0625 13.2559 16.2917 13.0195L19.8708 9.36289L14.9417 8.61524C14.6125 8.56367 14.3292 8.34883 14.1875 8.04375L11.9958 3.39238Z"></path>
                      <path d="M7.70418 13.0195C7.93335 13.2559 8.03752 13.5953 7.98335 13.9262L7.14168 19.0652L11.525 16.6504C11.8208 16.4871 12.175 16.4871 12.4667 16.6504L16.85 19.0652L16.0083 13.9262C15.9542 13.5953 16.0625 13.2559 16.2917 13.0195L19.8708 9.36289L14.9417 8.61524C14.6125 8.56367 14.3292 8.34883 14.1875 8.04375L11.9958 3.39238V11L7.70418 13.0195Z"></path>
                      <path d="M11.9958 3.39238L9.80835 8.04375C9.66252 8.34883 9.37918 8.56367 9.05418 8.61524L4.12418 9.36289L7.70418 13.0195L11.9958 11V3.39238Z"></path>
                    </svg>
                  </span>
                </div>
              </div>
              <div className="absolute left-3 -top-12">
                <svg xmlns="http://www.w3.org/2000/svg" width="56" height="56" viewBox="0 0 56 56" fill="none">
                  <g filter="url(#filter0_d_2103_5130)">
                    <path d="M18.1993 50.0968H10.6861C6.41606 50.0968 2.91602 46.6202 2.91602 42.3269V28.7936C2.91602 27.8369 3.70935 27.0436 4.66602 27.0436H18.1993C22.6327 27.0436 25.9694 30.3801 25.9694 34.8135V42.3269C25.946 46.7602 22.6093 50.0968 18.1993 50.0968ZM6.41602 30.5668V42.3502C6.41602 44.7069 8.32939 46.6201 10.6861 46.6201H18.1993C20.6727 46.6201 22.4694 44.8236 22.4694 42.3502V34.8368C22.4694 32.3635 20.6727 30.5668 18.1993 30.5668H6.41602Z" fill="#DC2F02"></path>
                    <path d="M4.66602 30.5668C3.70935 30.5668 2.91602 29.7734 2.91602 28.8168C2.91602 14.2334 5.87941 11.1769 14.3494 6.16019C15.1894 5.67019 16.2627 5.95021 16.7527 6.76688C17.2427 7.60688 16.9626 8.68014 16.146 9.17014C8.58598 13.6501 6.41602 15.5168 6.41602 28.8168C6.41602 29.7734 5.62268 30.5668 4.66602 30.5668Z" fill="#DC2F02"></path>
                    <path d="M45.3146 50.0968H37.8013C33.5313 50.0968 30.0312 46.6202 30.0312 42.3269V28.7936C30.0312 27.8369 30.8246 27.0436 31.7812 27.0436H45.3146C49.7479 27.0436 53.0846 30.3801 53.0846 34.8135V42.3269C53.0846 46.7602 49.7479 50.0968 45.3146 50.0968ZM33.5546 30.5668V42.3502C33.5546 44.7069 35.468 46.6201 37.8246 46.6201H45.3379C47.8112 46.6201 49.608 44.8236 49.608 42.3502V34.8368C49.608 32.3635 47.8112 30.5668 45.3379 30.5668H33.5546Z" fill="#DC2F02"></path>
                    <path d="M31.8027 30.5668C30.8461 30.5668 30.0527 29.7734 30.0527 28.8168C30.0527 14.2334 33.0161 11.1769 41.4861 6.16019C42.3261 5.67019 43.3994 5.95021 43.8894 6.76688C44.3794 7.60688 44.0994 8.68014 43.2827 9.17014C35.7227 13.6501 33.5527 15.5168 33.5527 28.8168C33.5527 29.7734 32.7594 30.5668 31.8027 30.5668Z" fill="#DC2F02"></path>
                  </g>
                  <defs>
                    <filter id="filter0_d_2103_5130" x="2.91602" y="5.91821" width="52.168" height="44.1786" filterUnits="userSpaceOnUse" color-interpolation-filters="sRGB">
                      <feFlood flood-opacity="0" result="BackgroundImageFix"></feFlood>
                      <feColorMatrix in="SourceAlpha" type="matrix" values="0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 127 0" result="hardAlpha"></feColorMatrix>
                      <feOffset dx="2"></feOffset>
                      <feComposite in2="hardAlpha" operator="out"></feComposite>
                      <feColorMatrix type="matrix" values="0 0 0 0 0.53 0 0 0 0 0.113227 0 0 0 0 0.00481818 0 0 0 1 0"></feColorMatrix>
                      <feBlend mode="normal" in2="BackgroundImageFix" result="effect1_dropShadow_2103_5130"></feBlend>
                      <feBlend mode="normal" in="SourceGraphic" in2="effect1_dropShadow_2103_5130" result="shape"></feBlend>
                    </filter>
                  </defs>
                </svg>
              </div>
            </div>
          </SwiperSlide>
        </Swiper>
        <div className="auth-slider-pagination flex justify-center pt-8 gap-1"></div>
      </div>
    </div>
  );
}
