import { useEffect, useState } from "react";
import "./addToShoppingCartLargeBtn.css";
export default function AddToShoppingCartLargeBtn({ id }) {
  let [inCart, setInCart] = useState(false);
  useEffect(() => {
    let cart = JSON.parse(localStorage.getItem("cart"));
    let isInCart = cart.findIndex((item) => item == id);
    if (isInCart > -1) setInCart(true);
  }, []);

  function addToCart() {
    let cartList = JSON.parse(localStorage.getItem("cart")) || [];
    let isInTheCart = cartList.findIndex((item) => item == id);
    if (isInTheCart === -1) {
      cartList.push(id);
      setInCart(true);
    } else {
      cartList.splice(isInTheCart, 1);
      setInCart(false);
    }
    localStorage.setItem("cart", JSON.stringify(cartList));
  }

  return (
    <button onClick={addToCart} className={`text-sm text-nowrap add-to-cart ${inCart && "added"} `}>
      <div className="default">افزودن به سبد خرید</div>
      <div className="success">حذف از سبد خرید</div>
      <div className="cart">
        <svg width="25" height="25" viewBox="0 0 24 24" fill="white" xmlns="http://www.w3.org/2000/svg">
          <path
            fillRule="evenodd"
            clipule="evenodd"
            d="M0 3C0 2.44772 0.447715 2 1 2H3.67703C4.08593 2 4.45364 2.24895 4.6055 2.62861L5.15407 4H21.523C22.2304 4 22.7142 4.71453 22.4514 5.37139L19.5029 12.7428C19.1992 13.5021 18.4637 14 17.6459 14H8.21106L6.87255 16H19C19.5523 16 20 16.4477 20 17C20 17.5523 19.5523 18 19 18H5C4.63088 18 4.29178 17.7967 4.1179 17.4711C3.94402 17.1455 3.96365 16.7506 4.16895 16.4438L6.55276 12.8819L3 4H1C0.447715 4 0 3.55228 0 3ZM8.35407 12H17.6459L20.0459 6H5.95407L8.35407 12Z"
            fill="white"
          />
          <path d="M7.5 21.25C7.5 22.2165 6.7165 23 5.75 23C4.7835 23 4 22.2165 4 21.25C4 20.2835 4.7835 19.5 5.75 19.5C6.7165 19.5 7.5 20.2835 7.5 21.25Z" fill="white" />
          <path d="M18.25 23C19.2165 23 20 22.2165 20 21.25C20 20.2835 19.2165 19.5 18.25 19.5C17.2835 19.5 16.5 20.2835 16.5 21.25C16.5 22.2165 17.2835 23 18.25 23Z" fill="white" />
        </svg>
      </div>
      <div className="dots"></div>
    </button>
  );

  return (
    <button onClick={addToCart} className={`flex items-center justify-center w-full py-2 mt-1 gap-3 border border-yel2 bg-yel borderorg text-red fill-red cursor-pointer rounded-xl transition-colors duration-300 ${inCart ? "text-white bg-linear-270 from-[#DC2F02] to-[#FF7B00] fill-white" : "hover:text-white hover:bg-linear-270 from-[#DC2F02] to-[#FF7B00] hover:fill-white"} `}>
      <span>
        <svg className="transition-colors duration-300" xmlns="http://www.w3.org/2000/svg" width="20" height="18" viewBox="0 0 20 18">
          <path d="M0.000976562 0.84375C0.000976562 0.376172 0.372504 0 0.83431 0H2.41417C3.3482 0 4.15028 0.671484 4.32389 1.59961L5.60861 8.4375H15.9454C16.3239 8.4375 16.6538 8.18086 16.751 7.81172L18.3621 1.75078C18.4801 1.30078 18.9385 1.03359 19.3829 1.15664C19.8274 1.27969 20.0913 1.74023 19.9697 2.19023L18.3586 8.25117C18.0635 9.35508 17.0739 10.125 15.9454 10.125H5.92806L6.11556 11.127C6.19195 11.5242 6.5357 11.8125 6.935 11.8125H16.9454C17.4072 11.8125 17.7788 12.1887 17.7788 12.6562C17.7788 13.1238 17.4072 13.5 16.9454 13.5H6.935C5.73361 13.5 4.70237 12.6352 4.48014 11.4434L2.68848 1.91602C2.66417 1.78242 2.54959 1.6875 2.41417 1.6875H0.83431C0.372504 1.6875 0.000976562 1.31133 0.000976562 0.84375ZM4.44542 16.3125C4.44542 16.0909 4.48853 15.8715 4.57229 15.6667C4.65605 15.462 4.77881 15.276 4.93358 15.1193C5.08834 14.9626 5.27207 14.8383 5.47428 14.7535C5.67649 14.6686 5.89322 14.625 6.11209 14.625C6.33096 14.625 6.54768 14.6686 6.74989 14.7535C6.9521 14.8383 7.13583 14.9626 7.2906 15.1193C7.44536 15.276 7.56813 15.462 7.65189 15.6667C7.73564 15.8715 7.77875 16.0909 7.77875 16.3125C7.77875 16.5341 7.73564 16.7535 7.65189 16.9583C7.56813 17.163 7.44536 17.349 7.2906 17.5057C7.13583 17.6624 6.9521 17.7867 6.74989 17.8715C6.54768 17.9564 6.33096 18 6.11209 18C5.89322 18 5.67649 17.9564 5.47428 17.8715C5.27207 17.7867 5.08834 17.6624 4.93358 17.5057C4.77881 17.349 4.65605 17.163 4.57229 16.9583C4.48853 16.7535 4.44542 16.5341 4.44542 16.3125ZM16.1121 14.625C16.5541 14.625 16.978 14.8028 17.2906 15.1193C17.6032 15.4357 17.7788 15.8649 17.7788 16.3125C17.7788 16.7601 17.6032 17.1893 17.2906 17.5057C16.978 17.8222 16.5541 18 16.1121 18C15.6701 18 15.2461 17.8222 14.9336 17.5057C14.621 17.1893 14.4454 16.7601 14.4454 16.3125C14.4454 15.8649 14.621 15.4357 14.9336 15.1193C15.2461 14.8028 15.6701 14.625 16.1121 14.625ZM11.9454 1.6875V3.09375H13.3343C13.7961 3.09375 14.1676 3.46992 14.1676 3.9375C14.1676 4.40508 13.7961 4.78125 13.3343 4.78125H11.9454V6.1875C11.9454 6.65508 11.5739 7.03125 11.1121 7.03125C10.6503 7.03125 10.2788 6.65508 10.2788 6.1875V4.78125H8.88986C8.42806 4.78125 8.05653 4.40508 8.05653 3.9375C8.05653 3.46992 8.42806 3.09375 8.88986 3.09375H10.2788V1.6875C10.2788 1.21992 10.6503 0.84375 11.1121 0.84375C11.5739 0.84375 11.9454 1.21992 11.9454 1.6875Z"></path>
        </svg>
      </span>
      <span className="transition-colors duration-300">{inCart ? "حذف از" : "افزودن به"} سبد خرید</span>
    </button>
  );
}
